from.database import DataBase

db = DataBase()
db.connect()


def create_hosp_codes():
    v = DataBase()
    v.connect()
    values_list = [{'code': '01103', 'name': 'ביה"ח אסף הרופה', 'type': '1'},
                   {'code': '01108', 'name': 'ביה"ח ברזילי', 'type': '1'},
                   {'code': '01204', 'name': 'ביה"ח בני ציון', 'type': '1'},
                   {'code': '01107', 'name': 'ביה"ח נהריה', 'type': '1'},
                   {'code': '01106', 'name': 'ביה"ח הלל יפה', 'type': '1'},
                   {'code': '01109', 'name': 'ביה"ח פוריה', 'type': '1'},
                   {'code': '01102', 'name': 'ביה"ח רמבם', 'type': '1'},
                   {'code': '01201', 'name': 'ביה"ח איכילוב', 'type': '1'},
                   {'code': '01104', 'name': 'ביה"ח וולפסון', 'type': '1'},
                   {'code': '01105', 'name': 'ביה"ח זיו', 'type': '1'},
                   {'code': '01101', 'name': 'ביה"ח שיבה', 'type': '1'},
                   {'code': '11101', 'name': 'ביה"ח שער המנשה', 'type': '3'},
                   {'code': '11102', 'name': 'ביה"ח יהודה אברבנאל', 'type': '3'},
                   {'code': '11103', 'name': 'ביה"ח ע"ש פליגלמן מזור', 'type': '3'},
                   {'code': '11104', 'name': 'המרכז לבריאות הנפש בער יעקב', 'type': '3'},
                   {'code': '11105', 'name': 'המרכז הרפואי לברה''נ לב השרון', 'type': '3'},
                   {'code': '11106', 'name': 'ביה"ח מעלה הכרמל', 'type': '3'},
                   {'code': '11107', 'name': 'המרכז לבריאות הנפש בער שבה', 'type': '3'},
                   {'code': '11109', 'name': 'מרכז רפואי לבריאות הנפש ירושלים', 'type': '3'},
                   {'code': '21101', 'name': 'מרכז רפואי גריאטרי שמואל הרופא', 'type': '2'},
                   {'code': '21102', 'name': 'מרכז גריאטרי שיקומי ע''ש פלימן', 'type': '2'},
                   {'code': '22101', 'name': 'מרכז הגריאטרי המשולב ע"ש שוהם', 'type': '2'},
                   {'code': '22102', 'name': 'מרכז גריאטרי דורות נתניה', 'type': '2'},
                   {'code': '22103', 'name': 'מרכז גריאטרי ראשל"צ', 'type': '2'},
                   {'code': '31101', 'name': 'מרכז קהילתי לבריאות הנפש', 'type': '2'},
                   {'code': '1', 'type': 'חטיבה', 'type': '0'}]
    data = {'name': 'hospital_codes', 'values_list': values_list}
    v.post('app_data_decryptiontables', data)


def sub_business_topic():
    data_1 = {
        'sub_topic': [
            {'code': '11', 'name': 'תקן מוך איוש'},
            {'code': '12', 'name': 'כמויות נלוות'},
            {'code': '13', 'name': 'כמויות נלוות - מתוקן לאיוש'}
        ]
    }