HOSPITAL_TYPES = (
        ('1', 'כללים'),
        ('2', 'גריאטריים'),
        ('3', 'פסיכיאטריים')
    )

VERSION_TYPES = (
        ('1', 'חצי שנתי'),
        ('2', 'שנתי')
    )

ACTIVE_STATUS = (
        ('1', 'פעיל'),
        ('2', 'לא פעיל')
    )

BS_CODE = (
        ('1', 'תקן איוש ונלוות'),
        ('2', 'פעילות'),
        ('3', 'חווית המטופל'),
        ('4', 'הון אנושי'),
        ('5', 'איכות ובטיחות'),
        ('6', 'תשתית כלכלית ופזית'),
        ('7', 'ניצולת חדרי ניתוח'),
        ('8', 'תשתית טכנולוגית')
    )

MEASURE_TYPES = (
        ('1', 'ON TARGET'),
        ('2', 'LOW IS BETTER'),
        ('3', 'HIGH IS BETTER')
    )

FREQUENCY = (
        ('1', 'יומי'),
        ('2', 'חודשי'),
        ('3', 'רבעוני'),
        ('4', 'חציוני'),
        ('5', 'שנתי')
    )